# ParameterMapIterator Class

---
An iterator to a map relating a parameter name (the key, a String) to a parameter.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBParameterMapIterator
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public abstract class ParameterMapIterator : APIObject,
    	IEnumerator

    Public MustInherit Class ParameterMapIterator
    	Inherits APIObject
    	Implements IEnumerator

    public ref class ParameterMapIterator abstract : public APIObject,
    	IEnumerator

    [<AbstractClassAttribute>]
    type ParameterMapIterator =
        class
            inherit APIObject
            interface IEnumerator
        end
The ParameterMapIterator type exposes the following members.
| Name| Description
---|---|---
| ParameterMapIterator| For Internal Use Only.
Top
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Key| Retrieves the key that is the current focus of the iterator.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| MoveNext| Move the iterator one item forward.
| Reset| Bring the iterator back to the start of the map.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace